{
    "active-directory": "Active Directory (AD) is a directory service developed by Microsoft for Windows domain networks. It is included in most Windows Server operating systems as a set of processes and services.",
    "agent": "an Agent is a small program runnning on a compromised host, through which an attack can take control of the host. Agent from malicious attacker is so-called Trojan.",
    "android": "Android",
    "api": "Application Programming Interface(API) related",
    "apt": "Advanced Persistent Threat(APT) is a stealthy threat actor, typically a nation state or state-sponsored group, which gains unauthorized access to a computer network and remains undetected for an extended period.",
    "article": "it is an article(blog)",
    "aslr": "Address space layout randomization (ASLR) is a computer security technique involved in preventing exploitation of memory corruption vulnerabilities.",
    "aws": "Amazon Web Services, Inc. is a subsidiary of Amazon that provides on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a metered, pay-as-you-go basis.",
    "backdoor-detection": "backdoor check/scanning/detection related",
    "bash": "Bash(Unix Shell)",
    "basic-knowledge": "Basic knowledge of something",
    "big-data": "data sets that are too large or complex",
    "blog": "a Blog of someone, or Blog related things such as setup",
    "blue-team": "Both red teams and blue teams work toward improving an organization's security, but they do so differently. A red team plays the role of the attacker by trying to find vulnerabilities and break through cybersecurity defenses. A blue team defends against attacks and responds to incidents when they occur.",
    "bruteforce-dir": "bruteforce directory, an attacking tech in Security Penetration Testing",
    "buffer-overflow": "BOF, a software coding error or vulnerability that can be exploited by hackers to gain unauthorized access to corporate systems",
    "bug-hunt": "bug/vulnerability hunting realted",
    "burpsuite-extension": "extension/plugin for Burp Suite",
    "burpsuite": "Burp Suite - Application Security Testing Software by PortSwigger",
    "bypass-gfw": "you know",
    "c": "the C language",
    "c#": "C#(C Sharp)",
    "c2": "Command and Control Infrastructure, also known as C2 or C&C, is the set of tools and techniques that attackers use to maintain communication with compromised devices following initial exploitation",
    "cdn": "Content Delivery Network (CDN)",
    "celery": "Celery is a task queue implementation for Python web applications used to asynchronously execute work outside the HTTP request-response cycle.",
    "centos": "CentOS",
    "cheat-sheet": "Cheat sheet of something",
    "cisco": "Cisco",
    "cloud": "Cloud computing is on-demand access, via the internet, to computing resources—applications, servers (physical servers and virtual servers), data storage, development tools, networking capabilities, and more—hosted at a remote data center managed by a cloud services provider (or CSP).",
    "cn": "China/Chinsese",
    "cobalt-strike": "Cobalt Strike gives you a post-exploitation agent and covert channels to emulate a quiet long-term embedded actor in your customer’s network.",
    "code-audit": "a software code audit is a comprehensive analysis of source code in a programming project with the intent of discovering bugs, security breaches or violations of programming conventions. It is an integral part of the defensive programming paradigm, which attempts to reduce errors before the software is released.",
    "command-injection": "a kind of cyber attack that involves executing arbitrary commands on a host operating system (OS)",
    "comprehensive-tool": "a (security) Tool with Comprehensive functions",
    "container": "Container(virtualization/cloud related)",
    "cors": "Cross-origin resource sharing (CORS) (usually security) related",
    "course": "a Cource of something",
    "crack": "Cracking works for software",
    "cross-platform": "In computing, Cross-Platform software (also called multi-platform software, platform-agnostic software, or platform-independent software) is computer software that is designed to work in several computing platforms.",
    "ctf": "Capture the Flag (CTF) in computer security is an exercise in which \"flags\" are secretly hidden in purposefully-vulnerable programs or websites.",
    "data-set": "Sets of certain kind of Data",
    "database": "Database related",
    "decompile": "Decompile/Decompiler related",
    "defence-evasion": "Throughout an operation, threat actors and groups need to be constantly aware of the environment they are in. Any false move could set off detections and alert defenders. Because of this, threat actors try to avoid being detected by leveraging a number of techniques designed specifically to evade detection solutions. Threat actors and groups can avoid detection via simple masquerading and indicator removal or use morecomplex techniques such as obfuscation and impairing of security solutions.",
    "defence": "Security Defence related",
    "definition": "The definition of a certain ",
    "deserialization": "Deserialization is the process of restoring this byte stream to a fully functional replica of the original object, in the exact state as when it was serialized. Insecure deserialization is when user-controllable data is deserialized by a website. This potentially enables an attacker to manipulate serialized objects in order to pass harmful data into the application code.",
    "dev": "Development",
    "dex": ".dex file in Android, which is similar to java class files, but was run under the Dalvik Virtual Machine (DVM) on older Android versions, and compiled at install time on the device to native code with ART on newer Android versions.",
    "diagram-ascii": "ASCII diagram/charts drawing related",
    "dictionary": "a Dictionary for looking up something, usually for words or terminologies",
    "digital-forensics": "Digital forensics is the process of identifying, preserving, analyzing, and documenting digital evidence.",
    "dns": "DNS protocol related",
    "docker": "Docker",
    "dom-xss": "DOM-based XSS",
    "domain": "Domain(Domain Name System(DNS)) related",
    "economics": "Economics",
    "english": "English",
    "env": "Environment setup",
    "error": "an Error occurred in an application",
    "exp-search": "site/page able to search for vulnerability exploitation details(code)",
    "fingerprint": "a Fingerprint/footprint in cybersecurity is a set of data that can be used to detect operating systems, protocols, software, and hardware of a tech stack. Cybersecurity fingerprinting enables penetration testers and advanced operators to build a server profile by correlating various data sets. ",
    "firebird": "an open source database for Windows, Linux, Mac OS X and more",
    "forum": "a Forum site",
    "framework": "a (software) framework of something",
    "frontend": "Frontend related",
    "ftp": "FTP",
    "git": "Git",
    "github-action": "Github Action related",
    "github": "Github related(not a Github url), Github API .e.g.",
    "go": "Golang",
    "goby": "Goby is a new generation network security assessment tool. It can efficiently and practically scan vulnerabilities while sorting out the most complete attack surface information for a target enterprise. Goby can also quickly penetrate the company intranet based on a company's vulnerabilities exposed to the Internet",
    "hardware": "Hardware/Device realted",
    "hexo": "Hexo",
    "how-to": "providing detailed and practical advice about the way to do something.",
    "htb": "https://www.hackthebox.com/ | Hacking Training For The Best",
    "http": "the Hypertext Transfer Protocol (HTTP)",
    "investment": "Investment",
    "iot": "Internet of things (IoT) related",
    "issue": "Solution to a issue",
    "it": "Information Technology",
    "japanese": "Japanese",
    "java": "Java",
    "javascript": "Javascript",
    "jwt": "JSON Web Token(JWT)",
    "k8s": "Kubernetes, commonly abbreviated K8s) is an open-source container orchestration system for automating software deployment, scaling, and management",
    "lateral-movement": "Lateral movement is a technique that adversaries use, after compromising an endpoint, to extend access to other hosts or applications in an organization. Lateral movement helps an adversary maintain persistence in the network and move closer to valuable assets.",
    "learnig-notes": "notes written by someone about learning something",
    "library": "a moudle/package/library (usually third party ones) of certain development language",
    "license": "Software or knowledge license related",
    "linux": "Linux",
    "log": "software/application log related",
    "malware-analysis": "Malware analysis related",
    "markdown": "Markdown",
    "methodology": "Methodology is the tao of doing a certain job.",
    "midware": "Middleware is a type of computer software that provides services to software applications beyond those available from the operating system.",
    "mitm": "In cryptography and computer security, a man-in-the-middle, monster-in-the-middle, machine-in-the-middle, meddler-in-the-middle, manipulator-in-the-middle(MITM), person-in-the-middle(PITM) or adversary-in-the-middle(AiTM) attack is a cyberattack where the attacker secretly relays and possibly alters the communications between two parties who believe that they are directly communicating with each other, as the attacker has inserted themselves between the two parties.",
    "module": "a moudle/package/library (usually third party ones) of certain development language",
    "msf": "Rapid7 Metasploit Framework",
    "navigation": "a Navigation page/site to other sites/pages",
    "network": "Network",
    "news": "News site/page",
    "oa": "Office Automation (Syatem) related",
    "oast": "Out-of-band application security testing (OAST) uses external servers to see otherwise invisible vulnerabilities. It was introduced to further improve the DAST (dynamic application security testing) model.",
    "optimization": "Optimization tips about a software/application",
    "oscp": "OffSec OSCP Certification",
    "oss": "Open-Source Software(OSS)",
    "oswe": "OffSec OSWE Certification",
    "outline": "just a Outline of a certain topic, without details",
    "payload": "Payload in cyber security is a term used to describe the malicious code or content that is delivered to a target system or device. It is the actual malicious code that is used to exploit a vulnerability or gain access to a system.",
    "pdf": "PDF resources",
    "penetration": "Security Penetration Testing related",
    "port-scan": "Port Scanning, a tech in Reconnaissance",
    "posh": "Oh My Posh enables you to use the full color set of your terminal by using colors to define and render the prompt.",
    "post": "The main purpose of Post-Exploitation is to gain access to all parts of the target system without knowing the user or without being detected.",
    "powershell": "Microsoft PowerShell related",
    "powerview": "PowerView is a PowerShell tool in the PowerSploit project to gain network situational awareness on Windows domains. It contains a set of pure-PowerShell replacements for various windows \"net *\" commands, which utilize PowerShell AD hooks and underlying Win32 API functions to perform useful Windows domain functionality.",
    "privilege": "Privilege related (security vulnerability)",
    "productivity": "Productivity promoting related",
    "protocol": "network/hardware Protocol",
    "proving-grounds": "Virtual Pentesting Labs powered by OffSec",
    "proxy": "Proxy tool/software used in Internal Network Penetration Testing.",
    "pytest": "Python PyTest",
    "python": "Python",
    "rdp": "Remote Desktop Protocol",
    "reading": "Reading related",
    "recon": "short for Reconnaissance, a process in Security Penetration Testing",
    "red-team": "Both red teams and blue teams work toward improving an organization's security, but they do so differently. A red team plays the role of the attacker by trying to find vulnerabilities and break through cybersecurity defenses. A blue team defends against attacks and responds to incidents when they occur.",
    "report": "a Report for something, or some resources/tools for report writing.",
    "research": "outcome of a research",
    "resource-collection": "a Collection of certain kind of Resource",
    "resource-search": "a site able to search for certain kind of resource",
    "resource": "a site of certain kind of resources",
    "reverse-engineering": "Reverse Engineering is a process in which software, machines, aircraft, architectural structures and other products are deconstructed to extract design information from them",
    "reverse-shell": "Reverse Shell, also known as remote shell or “connect-back shell”, takes advantage of the target system’s vulnerabilities to initiate a shell session and then access the victim’s computer",
    "ruby": "Ruby",
    "sec": "Security",
    "sensitive-info": "Sensitive Information related(leak/gathering/tool)",
    "shell": "the Shell language(.sh file)",
    "shellcode": "In hacking, a shellcode is a small piece of code used as the payload in the exploitation of a software vulnerability.",
    "sql-injection": "SQL Injection attacks",
    "ssl": "Secure Sockets Layer (SSL)",
    "ssrf": "Server-side request forgery(SSRF)",
    "sub-domain": "sub-domain gathering, a tech in Reconnaissance",
    "sudo": "Unix sudo",
    "tag": "Tag related",
    "task-queue": "Task queues are used as a mechanism to distribute work across threads or machines.",
    "tcp": "the Transmission Control Protocol(TCP)",
    "tee": "Unix tee",
    "terminology": "Terminology",
    "test-automation": "Test automation tool/software/framework",
    "test": "the Testing part in Software Development",
    "tips": "Tips",
    "token": "token related",
    "tool-collection": "a Collection of Tools",
    "tool": "Tool",
    "translation": "Translation related",
    "try-hack-me": "https://tryhackme.com/ | Cyber Security Training site",
    "udp": "User Datagram Protocol(UDP)",
    "unix": "Unix",
    "user-enum": "User/Account Enumeration is when a malicious actor can use brute-force techniques to either guess or confirm valid users in a system.",
    "vacabulary": "Vacabulary",
    "version-control": "Software Version Control related",
    "vim": "Unix Vim",
    "vscode": "Visual Studio Code",
    "vsfptd": "a GPL licensed FTP server for UNIX systems, including Linux",
    "vul-alert": "site/page for vulnerability/attack alert",
    "vul-collection": "a collection/series of vulnerabilities, ",
    "vul-definition": "Definition of Vulnerabilitie(s)",
    "vul-exp": "Vulnerability/Bug Exploitation code related",
    "vul-range": "vulnerable/buggy (Web) Application which is created intentionally for testing or traning, like a shooting Range",
    "vul-scan": "Vulnerability Scanning/Scanner related",
    "vul-search": "site/page able to search for vulnerability information",
    "waf": "Web Application Firewall (WAF)",
    "walk-through | write-up": "the note of solution, usually for a CTF challenge or vulnerable range",
    "web": "Web",
    "webapp": "Web Application",
    "weblogic": "Oracle WebLogic Server",
    "webshell": "a web shell is a shell-like interface that enables a web server to be remotely accessed, often for the purposes of cyberattacks.",
    "wiki": "Wiki",
    "windows": "Microsoft Windows related",
    "wordlist": "Wordlist",
    "wsl": "Windows Subsystem for Linux (WSL)",
    "xss": "Cross-Site Scripting (XSS) attacks related"
}